{"review_id": "ADgzZ-J6QSa6Br9rlzFbyw", "user_id": "FfLr93ATOMST23DlATE0Zw", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I can't favorably review any sushi place that feels the need to add filler to spicy tuna. It just screams cheap. Not to mention it kills quite a few options for the gluten free crowd. Shame. The decor was nice,  nicer than I'd expect from a place in a strip mall.  And the wait staff was friendly. Also didn't care for them talking me out of ordering rolls with brown rice. Prefer to eat healthier whenever possible. If your sushi chefs aren't skilled enough to roll with it,  don't offer it on the menu. \n\nAlso,  if I mention I have a wheat allergy,  and I order quite a few things that have wheat to whatever degree in it  alert me before you make my order,  not after and point out I can't eat 90% of what you bring out. I purposely ordered a couple things so my date could enjoy more,  but things I've been ordering for years many other places without issue contained wheat (crunch most likely) here. Again  just seems like they're trying to go on the cheap.", "date": "2013-03-21 14:49:28"}
{"review_id": "F99sxMJTgav1moAIojM5qQ", "user_id": "y7bXy8kWVrf6yGWXMDFmSw", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I'm normally all about going to privately owned restaurants than chains. So i figured I would give this place a try and it did nothing for me.\nI ordered the Thai Iced tea (which was weirdly served with whipped cream) and was WAY too sweet. When I asked the server if it could be fixed, she just told me to add water to it. Moving past that, I ordered the veg Tempura but the tempura batter was plain and not flavorful at all. The soy sauce served for dipping at the time added no flavor to it. I ordered the Spicy Thai Basil vegetables and asked if I could add tofu to it. I was told there was tofu in it already. When I received it, there was no tofu in it and the  dish was not spicy and also lacked flavor. It wasn't bland per say but it just felt like a meal that wasn't worth going out to a restaurant for. So overall, I wasn't impressed. Maybe I was just unlucky and ordered the few things on their menu that weren't good. On the other hand, the decor is really nice which was a nice surprise. The ambiance is impressive and the presentation of their food is quite impressive as well.", "date": "2013-07-20 18:45:37"}
{"review_id": "vcdgYGYjmfWhH8WSgaYBVg", "user_id": "Fg_7ryqQo4nYXy_uWMIUXA", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I can't believe that this place is \"under the radar\" as it is.  A true hidden gem.\n\nAmong the best Asian food I've ever had, and at a great price to boot.  The pineapple chicken is amazing!\n\nAlso, they stay true to their name.  Their wild rice is real, tasty, purple wild rice.\n\nTheir menu has traditional dishes, fusion, hibachi and sushi, so there are lots of bases to cover.  I haven't had their hibachi or sushi yet, so I can't vouch for that, but honestly, their other stuff is so good that this place gets five stars no matter what.", "date": "2013-03-21 17:31:30"}
{"review_id": "cmZfoPonKOa4EvUj09gBcw", "user_id": "etpDBsakwree7-KJpGRXwQ", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have eaten here twice, and both times had the same experience. I doubt if I will be here again. The the decor is very nice but the food is only average at best.", "date": "2014-07-30 21:29:41"}
{"review_id": "bGE6W4TJWDZITUdZf48lQQ", "user_id": "5R1NcRK7X8R7AvQopIze0A", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "It's a lovely restaurant. Everything is well prepared. Sauces are delicate and flavorful.  Veggies are fresh and crispy. Meet is tender. Sushi is well done and yummy. I get their bento box for lunch. It's a perfect amount of food and everything is tasty.", "date": "2014-05-13 18:47:07"}
{"review_id": "ShTnDIFmJXf6mJwACf1yyg", "user_id": "epbpi0To8z1coogIhUOzrg", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "I've been here a few times for lunch.  Lunch specials are great if you want something  relatively healthy, inexpensive and delicious. $6-8.00 gets you a cup of soup, a lunch sized entree and a serving of rice.  Staff is friendly and attentive.  Usually in and out in 20-25 min.  Very nice atmosphere.", "date": "2012-11-17 22:55:14"}
{"review_id": "ZBs4JFigVu66ZRpS7jlqzQ", "user_id": "dX7xtvNCVqnclJOwHLwdug", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been eating at this site for over 2 years and have yet to have a complaint.  I think this is the best Chinese food in the area, and both the sushi and hibachi are very good as well.  The staff is excellent and the place is decorated nicely.  It is always very clean.  Even my taste-restrictive parents love this place.  I think they have a very unique sauce for the General Tso's dish.  Their sauce is very sick, but not overly sweet like some places.  They also have a wider variety menu than most places (Chinese, Japanese, and Thai options).  The closest thing I have to a criticism is that the Thai dishes were OK, not great like the rest of their dishes...but that is stretching for a criticism.  The shopping center it is in may turn some people off because it is old, but Wild Rice is truly a gem in the area.", "date": "2012-09-23 19:37:15"}
{"review_id": "-jr4rj_8Xpute3vJx1uS-Q", "user_id": "PvRlpG-PYfrK2ya0g-wCAg", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went twice. The food was good, but I was so turned off by the wait staff -  which acted like they were doing you a big favor to be serving your table - that I won't return.", "date": "2011-06-12 21:37:33"}
{"review_id": "ccBhip4s8R3BeCy19nn7Uw", "user_id": "pMeULQnTYO77aNcdadf-NQ", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome Service.\n\nAMAZING Tempora Vegetable Roll.", "date": "2013-01-22 20:32:22"}
{"review_id": "0zK_LpaWjWEkT-uPD2ZyTw", "user_id": "o8A1r2-urp6CR85B2VG-Hg", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome! They have a fantastic and varied menu; the best of all (Asian) worlds! The menu is a delectable mix of Japanese, Chinese, Thai, Malaysian, etc. They of course serve Sushi, the usual classics, as well as fancier versions. They also have a Hibachi grill. This place serves up the best Shumai I've ever had. The Sushi is fantastic, I've had Sashimi, and the fish is very fresh. I haven't tried the Hibachi, so can't comment on that. The Thai curry is better than that of the totally overpriced White Orchids. The ambience is nice, but it gets really loud in there due to the Hibachi and the accompanying shrieks from people who act like they're seeing the Onion volcano for the first time. Servers are very friendly. They do have an alcohol license if you're looking for a Sake fix. Great place to go if you have a group where each person is looking for different types of Asian cuisine.", "date": "2011-05-14 16:42:20"}
{"review_id": "zEZL37S0whYqeRmUL7WAvQ", "user_id": "H_kyZVsbS8W71IoRRMoWwA", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Tried both the Hibachi cooking and some Sushi. Hibachi was OK, but not as good as others close by. Chef tried to be tricky and funny, but kept dropping things and making mistakes. \nSushi seemed like it was frozen fish quality. Not nearly as good or fresh as Bamboo or Liu's. They are close by and better choices for fresh Asian food. No other customers at lunch time other than our table. Not a good sign. Staff were eating their lunch in the dining room while we ate. Not very inviting.\nI think it was my first and last visit. There are too many better choices close by.", "date": "2012-09-08 11:22:17"}
{"review_id": "TyqomDMrQmuD1TPA5kf8mg", "user_id": "-Oqcye1jDaq_M3CO5kW8kQ", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "So Wild Rice is definitely one of my favorite sushi places ever. The only reason is the unlimited all you can eat made to order sushi for twenty dollars. You're warned only order one to two rolls at a time. If you leave anything left on the plate they will charge you extra for wasting food. They have great sushi though and the unlimited sushi is great because you can order any of the rolls/ special rolls. Oh yeah don't order like 4 rolls at once...... you'll want to kill yourself.... -___-. Oh and no sharing sushi because that's illegal I guess. Overall great sushi and I want to try some of their other dishes as well.", "date": "2012-03-24 21:37:30"}
{"review_id": "0_xm2ES2mmmYaqHyYg7XQQ", "user_id": "rBayFw6OTIjxeMBfZlXvoQ", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Always hesitant to try sushi out of our area (NY/LI), but this place was so delicious, we went two days in a row! The sushi was fresh and tasted amazing. We loved the Mama roll that we had to go twice! My kids enjoyed the hibachi show and I have never seen them eat so much! The shrimp tempura roll was also quite good as was the General Tso chicken which was accompanied with perfect fried rice. Ella served us both times and was a pleasure. This will be our new favorite restaurant when we are in town.", "date": "2014-06-08 15:00:47"}
{"review_id": "MHVAEY-O1YdOYhJwfUH15Q", "user_id": "j4OdQpxJfghLQ6OGxyd8Pg", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went there for lunch on a weekday. It wasn't very busy. Ordered shushi lunch for about $10. Good food at very reasonable price. Eating atmosphere is much better than a typical Chinese restaurant. Friendly services as well. I would definitely go back.", "date": "2014-05-03 02:00:29"}
{"review_id": "BNTWRe34JgkCaiGhGGjDxA", "user_id": "AHzGwafSuqhrGn5MYtH03w", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "I love the atmosphere of this restaurant. It's the calming with the lighting, and just trendy enough to set it apart (without being overdone) from other Asian restaurants in the area.\n\nThe food is good, although I think some of the sushi rolls are a bit overpriced and my Bento Box came out a little cold at lunch; however, it was really busy so I'm not overly concerned about it- the flavors were spot on! My friend got General Tso's, and that was delicious too. Lunch portions are perfect, being big enough to be filling but small enough so you aren't lagging the rest of the day. The food is surprisingly light for this type of cuisine.\n\nService here is wonderful. The staff is incredibly friendly and attentive. I think this would be a really fun restaurant to go to with a small group of people.\n\nMy only note would be that some of the sushi comes with a soy wrap instead of seaweed. I have an allergy to soy, and I didn't read the menu closely enough so I was a bit surprised when my Peking Duck roll came with a soy wrap- no harm done though. It was delicious, even picked apart without the wrap!", "date": "2011-07-28 04:50:11"}
{"review_id": "M8oLY0dfwwWqiNqSfnmElw", "user_id": "nYRPpErv8ktdNJqH3-V7ew", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wild Rice is at the top of the charts\n\nIf you are looking for real authentic Asian Fusion dishes you have to go to WR.\nThe atmosphere is great for a business meeting or dinner with the family and service from Mei and Ella are always first class.\nThey really get it and treat everyone very well if you are a regular or if it's your first time you always get fast fresh and tasty dishes dining in or taking out.\n\nHere are some of my favorites\n\n*Crispy Shrimp Hunan Style (the sauce is ridiculous) I always buy some extra and keep it in the fridge and is amazing on a nice grass fed rib eye from wegmans later that week\n*Snowy Mountain Roll (a must with every visit)\n*Lobster delight Roll (I have eaten at the great Iron Chef Morimoto's and you would swear this was from his kitchen) \n*Hibachi Steak and Lobster (tender and juicy)\n*Chicken & Broccoli (I get it with garlic sauce vs the standard sauce)\n* for the kids the sweet and sour chicken combo with fried roast pork rice and miso soup (extra miso, hold the nori) is my daughters go to \n\nIf you are reading this post I hope you pick up the phone make reservations or order out and try WR and get hooked", "date": "2012-12-29 04:02:43"}
{"review_id": "Oj7AHlnNzZ5QBx3d0KuQeg", "user_id": "Ailxr36vHIr4ZsK01nNgmw", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Went here tonight with my husband and two children.  It was our first time at this restaurant.  We decided to enjoy a fun hibachi dinner.   The chef was really great and our food was good.  They give you a lot of food for the hibachi dinner.  Well worth the price.  What was most outstanding was the service.  They were so nice, attentive and extremely fun and friendly to my kids.  They even opened up the hibachi section  for us even though they technically have that section closed on Mondays (they had to call the hibachi chef who was off, but he came in to accomodate us).  We will definitely be back.", "date": "2011-11-29 01:23:01"}
{"review_id": "_FhI8l6IVJLOn0RG0SsD8w", "user_id": "vW5HWuuMnhE2QKfvGtO7lg", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "The service was very friendly and our hibachi chef was very personable and put on a good show. The food while generously portioned lacked a little in seasonings and flavor that would of bumped this review up a star. Unfortunately we won't be returning, since we like a couple other hibachi places better.", "date": "2014-05-24 03:59:41"}
{"review_id": "mqhOAH0XVtWEZoEcIV7D5g", "user_id": "Rt5TlVMXJXyyGL-JTgajow", "business_id": "W8N-jHFE-scka656EU3btA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went with my fiancé and another couple on a Saturday night. The food was excellent! Service was okay - took a little while for the waitress to first come over, but everyone was pleasant. Our only complaint was that for the four hibachi tables, there was only one chef. So as a table was finishing, there was always another waiting to begin. We will definitely be back and hope for multiple chefs next time!", "date": "2012-02-22 17:39:51"}
